Австралия/src/InformationRegisters/NumberingIndexes/NumberingIndexes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>NumberingIndexes</name>
  <resources>
    <name>Index</name>
    <type>
      <types>DefinedType.NumberingIndex</types>
    </type>
  </resources>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Object</name>
    <type>
      <types>EnumRef.OperationTypesGoodsIssue</types>
      <types>EnumRef.OperationTypesDebitNote</types>
      <types>EnumRef.OperationTypesSupplierInvoice</types>
      <types>EnumRef.OperationTypesTaxInvoiceReceived</types>
      <types>CatalogRef.BusinessUnits</types>
      <types>EnumRef.OperationTypesPurchaseOrder</types>
      <types>EnumRef.OperationTypesOnlinePayment</types>
      <types>EnumRef.OperationTypesPaymentExpense</types>
      <types>EnumRef.OperationTypesPaymentReceipt</types>
      <types>EnumRef.OperationTypesGoodsReceipt</types>
      <types>EnumRef.OperationTypesEmployeeTask</types>
      <types>EnumRef.OperationTypesCashReceipt</types>
      <types>EnumRef.OperationTypesSalesInvoice</types>
      <types>EnumRef.OperationTypesInventoryTransfer</types>
      <types>EnumRef.OperationTypesSalesOrder</types>
      <types>EnumRef.OperationTypesTaxAccrual</types>
      <types>EnumRef.OperationTypesProduction</types>
      <types>EnumRef.OperationTypesCustomsDeclaration</types>
      <types>EnumRef.OperationTypesTransferAndPromotion</types>
      <types>EnumRef.OperationTypesTransferOrder</types>
      <types>EnumRef.OperationTypesPayrollSheet</types>
      <types>EnumRef.OperationTypesCashVoucher</types>
      <types>CatalogRef.Companies</types>
      <types>EnumRef.OperationTypesOnlineReceipt</types>
      <types>EnumRef.OperationTypesGoodsReturn</types>
      <types>EnumRef.OperationTypesIntraWarehouseTransfer</types>
      <types>EnumRef.OperationTypesArApAdjustments</types>
      <types>EnumRef.OperationTypesProductionOrder</types>
      <types>EnumRef.LoanAccrualTypes</types>
      <types>CatalogRef.Counterparties</types>
      <types>EnumRef.OperationTypesKitOrder</types>
      <types>EnumRef.OperationTypesAdditionalExpenses</types>
      <types>EnumRef.OperationTypesTaxInvoiceIssued</types>
      <types>EnumRef.OperationTypesCreditNote</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/NumberingIndexes/Forms/RecordForm/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	FillTypesList(Items.IndexObjectType.ChoiceList);
	
	If Parameters.Property("ObjectType") And ValueIsFilled(Parameters.ObjectType) Then 
		If Not ValueIsFilled(Parameters.CopyingValue) Then 
			Record.Object = New(Parameters.ObjectType);
		EndIf;
	EndIf;
	
	If Parameters.Property("Object") And ValueIsFilled(Parameters.Object) Then 
		RecordManager = InformationRegisters.NumberingIndexes.CreateRecordManager();
		RecordManager.Object = Parameters.Object;
		RecordManager.Read();
		If RecordManager.Selected() Then 
			ValueToFormAttribute(RecordManager, "Record");
		Else
			Record.Object = Parameters.Object;
		EndIf;
		Items.IndexObjectType.ReadOnly = True;
		Items.Object.ReadOnly = True;
	EndIf;
	
	If Record.Object = Undefined Then
		Items.Object.Enabled = False;
	Else
		IndexObjectType = TypeOf(Record.Object);
		Items.Object.Enabled = True;
	EndIf;
	
EndProcedure

&AtServer
Procedure OnWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	If IndexObjectType = Type("CatalogRef.Companies") Then
		
		CompanyObject = Record.Object.GetObject();
		CompanyObject.Prefix = Record.Index;
		
		Try
			CompanyObject.Write();
		Except
			MessagePattern = NStr("en = 'Error occured while trying to update company prefix:
										|%1'; 
										|ru = 'При попытке обновления префикса организации произошла ошибка:
										|%1';
										|pl = 'Błąd wystąpił podczas próby aktualizacji prefiksu firmy:
										|%1';
										|es_ES = 'Se ha producido un error al intentar actualizar el prefijo de la empresa:
										|%1';
										|es_CO = 'Se ha producido un error al intentar actualizar el prefijo de la empresa:
										|%1';
										|tr = 'Şirket önekini güncellemeye çalışırken hata oluştu: 
										| %1';
										|it = 'Errore durante il tentativo di aggiornare il prefisso azienda:
										|%1';
										|de = 'Beim Versuch, das Firmenpräfix zu aktualisieren, ist ein Fehler aufgetreten:
										|%1'");
			MessageText = StringFunctionsClientServer.SubstituteParametersToString(
				MessagePattern,
				BriefErrorDescription(ErrorInfo()));
			CommonClientServer.MessageToUser(MessageText, , , , Cancel);
		EndTry;
		
	EndIf;
	
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure IndexObjectTypeOnChange(Item)
	
	If Not ValueIsFilled(IndexObjectType) Then
		Items.Object.Enabled = False;
		Record.Object = Undefined;
	Else
		Items.Object.Enabled = True;
		Record.Object = New(IndexObjectType);
	EndIf;
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure FillTypesList(TypesList) 
	
	InformationRegisters.NumberingIndexes.FillTypesList(TypesList);
	
EndProcedure

#EndRegion
